tutorials4NF/steadyStateNaturalConvection4NF/semiAnnulusHybridHeterogeneous/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel        laminar;//kEpsilon;

turbulence      off;

printCoeffs     off;

kEpsilonCoeffs
{
    Cmu              0.09;
    C1               1.44;
    C2               1.92;
    alphaEps         0.76923;
}

// ************************************************************************* //
