tutorials4NF/steadyStateNaturalConvection4NF/semiAnnulusHybridHeterogeneous/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300.0;

boundaryField
{
    inner
    {
	type		fixedValue;
	value		uniform 300.0;
    }

    outer
    {
	type		RobinBC4NF;
        flux            (4.0e2    0.0    0.0    0.0    0.0    0.0    0.0    0.0    0.0    0.0    0.0);
        dir             (0 1 0);
        ho              11.0;
        To              270.0;
    }

    ".*"
    {
	type		zeroGradient;
    }
}
// ************************************************************************* //
