tutorials4NF/steadyStateNaturalConvection4NF/semiAnnulusHybridHeterogeneous/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss upwind;
    div(phi,T)      Gauss upwind;
    div((nuEff*dev(grad(U).T()))) Gauss linear;
    div((phi*interpolate((rho*Cp))),T) Gauss upwind;
    div(phi,alphai)			Gauss upwind;//-nanoFluid4Foam
}

laplacianSchemes
{
    default                      Gauss linear corrected;
    laplacian((1|A(U)),p)        Gauss linear corrected;
    laplacian(nuEff,U)           Gauss linear corrected;
    laplacian(kappaEff,T)        Gauss linear corrected;
}

interpolationSchemes
{
    default           linear;
    interpolate(HbyA) linear;
    laplacian(DT,T)   Gauss linear corrected;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
